Configuration/3D/M2/constant/V
version https://git-lfs.github.com/spec/v1
oid sha256:b3be9728f86923104dc79bbe4a16c08632a22ee97b992a314be2f2338163435c
size 7618616
